Revit 2024 API
BuiltInFailures.RebarFailures.HostTopologyChange Property
 A reinforced host has undergone a major change. The reinforcement must be removed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId HostTopologyChange { get; }
Visual Basic
Public Shared ReadOnly Property HostTopologyChange As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ HostTopologyChange {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace